Repository: KJELDAK/KhmerCookingGuideApp
Catalog: KhmerCookingGuideApp/*.lproj/Localizable.strings
Languages: km

source: Hello
km: សួស្ដី

source: What would you like
km: តើអ្នកចង់

source: to eat today ?
km: បរិភោគអ្វីក្នុងថ្ងៃនេះ?

source: Category
km: ប្រភេទ

source: Popular Dishes
km: មុខម្ហូបដែលកំពុងពេញនិយម

source: View all
km: មើលទាំងអស់

source: Ingredients
km: គ្រឿងផ្សំ

source: Description
km: ការពិពណ៌នា

# step
source: steps
km: ជំហាន

# ratings_and_review
source: Ratings & Review
km: ការវាយតម្លៃ និងមតិយោបល់

source: Tap to rate
km: ចុចដើម្បីវាយតម្លៃ

source: No rating and feedback yet
km: មិនទាន់មានការវាយតម្លៃ និងមតិយោបល់នៅឡើយ

source: All Rating and Review
km: មតិយោបល់ និងការវាយតម្លៃទាំងអស់

source: Write a Review
km: សរសេរការបញ្ចេញមតិ

source: Cancel
km: បោះបង់

# cannot_feedback_own_recipe
source: You cannot provide feedback on your own recipe
km: អ្នកមិនអាចផ្តល់មតិយោបល់លើមុខម្ហូបរបស់ខ្លួនឯងបានទេ

source: Edit
km: កែប្រែ

source: Delete
km: លុប

source: Are you sure to delete?
km: តើអ្នកប្រាកដទេថាចង់លុបវា?

# recipe_will_be_deleted
source: This recipe will be deleted.
km: រូបមន្តធ្វើម្ហូបនេះនឹងត្រូវបានលុបចេញ។

source: Confirm
km: បញ្ជាក់

source: Submit
km: បញ្ជូន

source: Back
km: ត្រឡប់

source: level
km: កម្រិត

# user_rating_comment_duplicate
source: You have already provided a rating and comment for this item.
km: អ្នកបានធ្វើការវាយតម្លៃ និងបញ្ចេញមតិរួចម្តងហើយ

source: My Profile
km: ព័ត៌មានផ្ទាល់ខ្លួនរបស់ខ្ញុំ

source: Favorites
km: កំណត់ត្រា

# terms_and_conditions
source: Terms & Conditions
km: លក្ខខណ្ឌ និង គោលការណ៍

source: Application Language
km: ភាសាកម្មវិធី

source: Logout
km: ចាកចេញ

source: Edit Profile
km: កែប្រែព័ត៌មានផ្ទាល់ខ្លួន

source: Role:
km: តួរនាទី:

source: Language
km: ភាសា

source: Please select a display language
km: សូមជ្រើសរើសភាសាសម្រាប់បង្ហាញ

source: English
km: ភាសាអង់គ្លេស

source: Khmer
km: ភាសាខ្មែរ

source: Select
km: ជ្រើសរើស

source: Full Name
km: ឈ្មោះពេញ

source: Gender
km: ភេទ

source: Save Changes
km: រក្សាការផ្លាស់ប្តូរ

# terms_title
source: Terms & Conditions
km: 📄 លក្ខខណ្ឌនិងគោលការណ៍ប្រើប្រាស់

# terms_intro
source: Please read carefully before using the Khmer Cooking Guide App
km: សូមអានយ៉ាងហ្មត់ចត់មុននឹងប្រើប្រាស់កម្មវិធី Khmer Cooking Guide App

# purpose_title
source: 🎯 1. Purpose of the App
km: 🎯 ១. គោលបំណងនៃកម្មវិធី

# purpose_content
source: This app is designed to provide Khmer cooking instructions and recipes for personal use only.
km: កម្មវិធីនេះត្រូវបានបង្កើតឡើងដើម្បីផ្ដល់ជូននូវការណែនាំចំអិនម្ហូបខ្មែរ និងរបៀបធ្វើម្ហូបជាច្រើនសម្រាប់អ្នកប្រើប្រាស់ក្នុងគោលបំណងផ្ទាល់ខ្លួនប៉ុណ្ណោះ។

# responsibility_title
source: 👤 2. User Responsibilities
km: 👤 ២. ការទទួលខុសត្រូវរបស់អ្នកប្រើប្រាស់

# responsibility_content
source: - Use the app respectfully. Do not share content that violates laws or others' rights. - Do not use the app for commercial purposes without permission.
km: - អ្នកត្រូវប្រើប្រាស់កម្មវិធីនេះដោយសុចរិត កុំចែកចាយមាតិកាដែលផ្ទុយនឹងច្បាប់ឬសិទ្ធិរបស់អ្នកដទៃ។ - កុំប្រើកម្មវិធីក្នុងគោលបំណងពាណិជ្ជកម្មដោយគ្មានការអនុញ្ញាត។

# content_title
source: 📸 3. Content & Intellectual Property
km: 📸 ៣. មាតិកា និងសិទ្ធិបញ្ញា

# content_content
source: - All images, methods, and other materials belong to Khmer Cooking Guide App. - Copying, distributing, or reusing content without permission is prohibited.
km: - រូបភាព របៀបធ្វើ និងមាតិកាផ្សេងៗក្នុងកម្មវិធីនេះគឺជាកម្មសិទ្ធិរបស់ Khmer Cooking Guide App។ - ការចម្លង បែកចែក ឬប្រើប្រាស់ដោយគ្មានការអនុញ្ញាតត្រូវបានហាមឃាត់។

# modification_title
source: 🔄 4. Changes to Terms
km: 🔄 ៤. ការផ្លាស់ប្តូរលក្ខខណ្ឌ

# modification_content
source: We may change or add terms at any time without notice. Please review periodically.
km: យើងមានសិទ្ធិកែប្រែ ឬបន្ថែមលក្ខខណ្ឌណាមួយនៅពេលណាមួយ ដោយមិនចាំបាច់ជូនដំណឹងជាមុន។ សូមពិនិត្យឡើងវិញជាប្រចាំ។

# privacy_title
source: 🔒 5. Privacy Protection
km: 🔒 ៥. ការការពារព័ត៌មានផ្ទាល់ខ្លួន

# privacy_content
source: We strive to keep your personal information secure and will not share it without consent.
km: យើងខិតខំរក្សារព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកឱ្យមានសុវត្ថិភាព និងមិនបង្ហាញអោយភាគីទីបី ដោយគ្មានការយល់ព្រមរបស់អ្នក។

# law_title
source: ⚖️ 6. Governing Law
km: ⚖️ ៦. ច្បាប់ដែលអនុវត្ត

# law_content
source: These terms are governed by the laws of the Kingdom of Cambodia.
km: លក្ខខណ្ឌទាំងនេះគឺស្ថិតក្រោមច្បាប់នៃព្រះរាជាណាចក្រកម្ពុជា។ ប្រសិនបើមានជម្លោះ យើងនឹងដោះស្រាយដោយផ្អែកលើច្បាប់នេះ។

# agreement_note
source: By continuing to use the Khmer Cooking Guide App, you agree to all the above terms.
km: ដោយបន្តប្រើប្រាស់ Khmer Cooking Guide App នេះ អ្នកយល់ព្រមនឹងលក្ខខណ្ឌទាំងអស់ខាងលើ។

# thank_you
source: Thank you for your trust and for using our app. 🍲🇰🇭
km: សូមអរគុណសម្រាប់ការជឿទុកចិត្ត និងការប្រើប្រាស់កម្មវិធីរបស់យើង។ 🍲🇰🇭

source: Food Name
km: ឈ្មោះម្ហូប

source: Duration
km: រយៈពេល

source: Update Recipe
km: កែប្រែរូបមន្តធ្វើម្ហូប

source: Recipe updated successfully
km: បានធ្វើកែប្រែរូបមន្តធ្វើម្ហូបដោយជោគជ័យ

source: Update rate and feedback
km: កែប្រែការវាយតម្លៃ និងការបញ្ចេញមតិ

# feedback_update_successfully
source: Feedback updated successfully
km: កែប្រែការវាយតម្លៃ និងការបញ្ចេញមតិជោគជ័យ

source: Phone Number
km: លេខទូរស័ព្ទ

source: Basic Information
km: ព័ត៌មានទូទៅ

source: Please fill all information.
km: សូមបំពេញព័ត៌មានទាំងអស់

# user_info_saved
source: User information saved successfully.
km: ព័ត៌មានអ្នកប្រើបានរក្សាទុកដោយជោគជ័យ

# technical_error
source: Technical error, please try again.
km: មានកំហុសបច្ចេកទេស សូមព្យាយាមម្តងទៀត

# register_title
source: Create an Account
km: បង្កើតគណនីថ្មី

# register_subtitle
source: Please enter your email to get started
km: សូមបញ្ចូលអ៊ីមែលរបស់អ្នកដើម្បីចាប់ផ្ដើម

# email_already_registered
source: The email address is already registered. Please use a different email.
km: អាសយដ្ឋានអ៊ីមែលនេះត្រូវបានចុះឈ្មោះរួចហើយ។ សូមប្រើអាសយដ្ឋានផ្សេង។

# email_invalid_format
source: Oops! Your email seems incorrect. Please use the format: example@gmail.com
km: អ៊ីមែលរបស់អ្នកមើលទៅមិនត្រឹមត្រូវទេ។ សូមប្រើទម្រង់: example@gmail.com

# email_password_invalid
source: Email and Password are not valid
km: អ៊ីមែល និងពាក្យសម្ងាត់មិនត្រឹមត្រូវទេ

source: Incorrect password!
km: ពាក្យសម្ងាត់មិនត្រឹមត្រូវ!

# login_success
source: Login Successfully
km: ចូលប្រើបានជោគជ័យ

# email_not_exist
source: Email does not exist. Please check and try again
km: អ៊ីមែលនេះមិនមាននៅក្នុងប្រព័ន្ធទេ។ សូមពិនិត្យម្តងទៀត។

# register_footer_line_1
source: Discover, Cook, Share – It All Starts Here
km: ស្វែងរក ចម្អិន ចែករំលែក – រឿងទាំងអស់ចាប់ផ្តើមនៅទីនេះ

# register_footer_line_2
source: Sign Up and Start Cooking!
km: ចុះឈ្មោះ និងចាប់ផ្តើមចម្អិនម្ហូប!

# enter_account
source: Please enter your account here
km: សូមបញ្ចូលគណនីរបស់អ្នកនៅទីនេះ

source: Welcome to you
km: សូមស្វាគមន៍

source: Password
km: លេខសម្ងាត់

source: Register
km: បង្កើតគណនីថ្មី

# no_account
source: Don't have an account?
km: មិនទាន់មានគណនីមែនទេ?

# login_agreement
source: By clicking “LOGIN” you agreed to our
km: ដោយការចុច “LOGIN” អ្នកបានយល់ព្រមទៅនឹង

# terms_of_service
source: Term of Service
km: លក្ខខ័ណ្ឌសេវាកម្ម

source: and
km: ហើយនិង

source: Privacy
km: ឯកជនភាព

source: Login
km: ចូល

source: Forgot Password
km: ភ្លេចពាក្យសម្ងាត់

# input_password
source: Input your password
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នក

# forgot_password_title
source: Forgot Your Password?
km: ភ្លេចពាក្យសម្ងាត់របស់អ្នក?

# forgot_password_message
source: Enter your email address to receive a reset link.
km: បញ្ចូលអ៊ីមែលរបស់អ្នកដើម្បីទទួលតំណភ្ជាប់សម្រាប់កំណត់ពាក្យសម្ងាត់ឡើងវិញ។

source: Next
km: បន្ទាប់

# discover_cook_share
source: Discover, Cook, Share – It All Starts Here
km: រុករក ចម្អិន ចែករំលែក – គ្រប់យ៉ាងចាប់ផ្តើមទីនេះ

# sign_up_start_cooking
source: Sign Up and Start Cooking!
km: ចុះឈ្មោះ ហើយចាប់ផ្តើមចម្អិន!

source: Back to
km: ត្រឡប់ទៅកាន់

source: Verification Code
km: ផ្ទៀងផ្ទាត់លេខកូដ

# enter_otp_message
source: Enter 6 digits code sent to your email
km: បញ្ចូលកូដ 6 ខ្ទង់ដែលបានផ្ញើទៅអ៊ីមែលរបស់អ្នក

source: Resend Code
km: ផ្ញើកូដម្តងទៀត

# resend_in
source: Resend code in
km: ផ្ញើកូដឡើងវិញក្នុងរយៈពេល

source: Continue
km: បន្ត

# invalid_OTP_format
source: Invalid OTP format [requires 6 digits]
km: ទម្រង់ OTP មិនត្រឹមត្រូវ [ត្រូវការខ្ទង់ 6]

source: Invalid OTP provided
km: OTP មិនត្រឹមត្រូវ

# otp_validated_and_email_verified
source: OTP validated and email verified successfully
km: បានផ្ទៀងផ្ទាត់ OTP និងអ៊ីមែលដោយជោគជ័យ

source: Create New Password
km: បង្កើតពាក្យសម្ងាត់ថ្មី

source: New Password
km: ពាក្យសម្ងាត់ថ្មី

source: Confirm New Password
km: បញ្ជាក់ពាក្យសម្ងាត់ថ្មី

# enter_new_password
source: Please enter your new password
km: សូមបញ្ចូលពាក្យសម្ងាត់ថ្មីរបស់អ្នក

# enter_confirm_password
source: Please enter your confirm password
km: សូមបញ្ចូលការបញ្ជាក់ពាក្យសម្ងាត់

source: Passwords do not match
km: ពាក្យសម្ងាត់មិនត្រូវគ្នា

source: Next
km: បន្ទាប់

source: Input your password
km: សូមបញ្ចូលពាក្យសម្ងាត់

source: Password created successfully
km: ពាក្យសម្ងាត់ត្រូវបានបង្កើតដោយជោគជ័យ

source: Save
km: រក្សាទុក

source: Email is empty.
km: អ៊ីមែលគឺទទេ

source: Recipe created successfully
km: បានបញ្ចូលរបៀបធ្វើម្ហូបដោយជោគជ័យ

source: Cuisines
km: ប្រភេទម្ហូប

source: Soup
km: ស៊ុប

source: Salad
km: សាឡាដ

source: Grill
km: អាំង

source: Fry
km: ចៀន

source: Stir-Fried
km: ឆា

source: Dessert
km: បង្អែម

source: Steam
km: ចំហុយ

source: Breakfast
km: អាហារពេលព្រឹក

source: Lunch
km: អាហារថ្ងៃត្រង់

source: Dinner
km: អាហារពេលល្ងាច

source: Snack
km: អាហារសម្រន់

source: Hard
km: ពីបាក

source: Medium
km: មធ្យម

source: Easy
km: ងាយស្រូល

source: Enter food name
km: បញ្ចូលឈ្មោះអាហារ

# tell_me_about_your_food
source: Tell me a little about your food
km: ប្រាប់ខ្ញុំបន្តិចអំពីអាហាររបស់អ្នក

source: Enter step description
km: ពិពណ៌នាអំពីជំហាននៃការធ្វើម្ហូប

source: Enter ingredient
km: បញ្ចូលគ្រឿងផ្សំ

source: Enter ingredient quantity
km: បញ្ចូលបរិមាណគ្រឿងផ្សំ

source: Your dishes
km: ម្ហូបរបស់អ្នក

source: Recipe
km: របៀបធ្វើម្ហូប

source: Food recipe posted successfully
km: របៀបធ្វើម្ហូបត្រូវបានបង្ហោះដោយជោគជ័យ

source: Search here
km: ស្វែងរកនៅទីនេះ

source: All
km: ទាំងអស់

source: Star Rating
km: ចំណាត់ថ្នាក់ផ្កាយ

source: Apply
km: អនុវត្ត

source: Soup
km: ស៊ុប

source: Salad
km: សាឡាដ

source: Grill
km: អាំង

source: Fry
km: ចៀន

source: Stir-Fried
km: ឆា

source: Dessert
km: បង្អែម

source: Steam
km: ចំហុយ

source: minutes
km: នាទី

source: No data
km: គ្មានទិន្នន័យ

source: Please try again
km: សូមព្យាយាមម្តងទៀត

source: Result not found
km: រកមិនឃើញលទ្ធផលទេ។

source: No Favorites Yet
km: មិនមានកំណត់ត្រានៅឡើយទេ

# start_exploring_text
source: Start exploring delicious Khmer recipes and save your favorites here!
km: ចាប់ផ្តើមស្វែងរករូបមន្តម្ហូបខ្មែរឆ្ងាញ់ៗ ហើយរក្សាទុករូបមន្តដែលអ្នកចូលចិត្តនៅទីនេះ!

source: Discover Recipes
km: ស្វែងរកមុខម្ហូប

# favorites_title
source: Favorites
km: កំណត់ត្រា

# feedback_success
source: Thanks! We've received your feedback.
km: សូមអរគុណ! យើងបានទទួលមតិយោបល់របស់អ្នក។

# delete_title
source: Are you sure you want to delete?
km: តើអ្នកប្រាកដជាចង់លុបមែនទេ?

# delete_message
source: This rating and feedback will be permanently removed.
km: ការវាយតម្លៃ និងមតិយោបល់នេះនឹងត្រូវលុបចោលជាអចិន្ត្រៃយ៍។

source: Email Address
km: អាសយដ្ឋានអ៊ីមែល

source: Gender
km: ភេទ

source: Created At
km: បង្កើតនៅ

source: Breakfast
km: អាហារពេលព្រឹក

source: Lunch
km: អាហារថ្ងៃត្រង់

source: Dinner
km: អាហារពេលល្ងាច

source: Home
km: ទំព័រដើម

source: Recipe
km: រូបមន្តម្ហូប

source: Favorite
km: កំណត់ត្រា

source: Profile
km: ពត៌មានផ្ទាល់ខ្លួន

# update_profile_success
source: Update profile successfully
km: ព័ត៌មានផ្ទាល់ខ្លួនត្រូវបានកែប្រែដោយជោគជ័យ

# update_profile_failed
source: Could not update profile please try again later
km: មិនអាចកែប្រែព័ត៌មានផ្ទាល់ខ្លួនបានទេ សូមព្យាយាមម្តងទៀតក្នុងពេលក្រោយ

# enter_full_name
source: Please enter your full name
km: សូមបញ្ចូលឈ្មោះពេញរបស់អ្នក

# enter_phone_number
source: Please enter your phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

# logout_title
source: Log Out
km: ចាកចេញ

# logout_message
source: Are you sure you want to log out?
km: តើអ្នកពិតជាចង់ចាកចេញមែនទេ?
